function lab05_main
%=== Дисципліна: Основи обробки біомедичної інформації ===
%--- Лабораторна робота #5 КОРЕЛЯЦІЙНИЙ АНАЛІЗ БІОСИГНАЛІВ
%
% Використовуйте файли даних: 
%   eeg1-c3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-f3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-f4.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-p3.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-p4.dat - сигнал ЕЕГ, fs = 100 Гц
%   eeg1-o2.dat - сигнал ЕЕГ, fs = 100 Гц
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #5')
disp('КОРЕЛЯЦІЙНИЙ АНАЛІЗ БІОСИГНАЛІВ')
disp('Виконав:  , група ... ННІІДС')

%=== Завдання #1.1 ===
% Моделювання стаціонарного випадкового процесу
fs =  
f0 =  
A =  
D =  
n =  
t = 		% вектор часу
r =  
x =  
s =  
% Графіки отриманих сигналів
figure()
...

%=== Завдання #1.2 ===
% Обчислення оцінки дисперсії шуму, дисперсії сигналу та відношення шум/сигнал
fprintf(...)
fprintf(...)
fprintf(...)
fprintf(...)

%=== Завдання #1.3 ===
% Обчислення незміщеної оцінки АКФ змодельованого процесу  
maxlag = fix(...);
[r, lags]=xcorr(...);
figure()
...
%=== Завдання #1.4 ===
% Обчислення зміщеної оцінки АКФ змодельованого процесу  
maxlag = fix(...);
[r, lags]=xcorr(...);
figure()
...

%=== Завдання #1.5 ===
% Обчислення оцінки АКФ змодельованого процесу при збільшенні тривалості процесу 
n = 
t = 	% вектор часу
r = 
x = 
s = 

maxlag = fix(...);
[r, lags]=xcorr(...);
figure()
...
 
%=== Завдання #2.1 ===
% Завантаження сигналу ЕЕГ файл (eeg1-p4.dat)
fs = 
eeg = 
eeg = 
t = 

figure()
...

%=== Завдання #2.2 ===
% Виділення епохи сигналу ЕЕГ від t1 = 4,7 с до t2 = 5,8 с
t1 =  
t2 = 
n1 = 
n2 = 
eeg1 = 
figure()
...

%=== Завдання #2.3 ===
% Обчислення незміщеної оцінки АКФ сигналу ЕЕГ
...

%=== Завдання #2.4 ===
% Обчислення середнього періоду та середньої частоти
 
%=== Завдання #2.5 ===
% Обчислення спектральної щільності сигналу
Sy = fft(...);
N = length(..);
f = 
figure()
...

%=== Завдання #2.6 ===
% Завантаження сигналу ЕЕГ файл (eeg1-f3.dat)
fs = 
eeg = 
eeg = 
t = 
figure()
...

% Виділення епохи сигналу ЕЕГ від t1 = 4,2 с до t2 = 4,96 с
t1 =  
t2 = 
n1 = 
n2 = 
eeg1 = 
figure()
...

% Обчислення незміщеної оцінки АКФ сигналу ЕЕГ
...

% Обчислення середнього періоду та середньої частоти

% Обчислення спектральної щільності сигналу
...

%=== Завдання #3.1 ===
% Завантаження сигналу ЕЕГ файл (eeg1-o2.dat)
...

% Завантаження сигналу ЕЕГ файл (eeg1-c3.dat)
...

%=== Завдання #3.2 ===
% Виділення епохи сигналів ЕЕГ від t1 = 5,71 с до t2 = 6,78 с
t1 = 
t2 = 
n1 = 
n2 = 
eege1 = 
eege2 = 
figure()
subplot(2,1,1)
...

%=== Завдання #3.3 ===
% Обчислення ВКФ сигналів ЕЕГ
...

%=== Завдання #3.4 ===
% Обчислення взаємної спектральної щільності сигналів ЕЕГ
...

%=== Завдання #3.5 ===
% Завантаження сигналу ЕЕГ файл (eeg1-p3.dat)
...

% Завантаження сигналу ЕЕГ файл (eeg1-p4.dat)
...
 
% Виділення епохи сигналів ЕЕГ від t1 = 4,7 с до t2 = 5,8 с
...

% Обчислення ВКФ сигналів ЕЕГ
...

% Обчислення взаємної спектральної щільності сигналів ЕЕГ
...

%=== Завдання #3.6 ===
% Завантаження сигналу ЕЕГ файл (eeg1-f3.dat)
...

% Завантаження сигналу ЕЕГ файл (eeg1-f4.dat)
...

% Виділення епохи сигналів ЕЕГ від t1 = 4,13 с до t2 = 4,96 с t3 = 1,43 с до t4 = 2,26 с
...

% Обчислення ВКФ сигналів ЕЕГ
...

% Обчислення взаємної спектральної щільності сигналів ЕЕГ
...

